tap "homebrew/bundle"

# Core tools
brew "git"
brew "gh"
brew "tree"
brew "shellcheck"
brew "shfmt"
brew "direnv"
brew "zoxide"
brew "python"
brew "uv"
brew "bun"
brew "codex"
brew "claude"

# Editors
brew "neovim"
brew "vim"
brew "tmux"

# Search & navigation
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"

# Data & utilities
brew "jq"
brew "coreutils"
brew "gnu-sed"
brew "trash"
